EDT/УТ/src/BusinessProcesses/новаМестнаяДоставка/новаМестнаяДоставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>новаМестнаяДоставка</name>
  <task>Task.новаЗадачаМестнойДоставки</task>
  <attributes>
    <name>Груз</name>
    <type>
      <types>DocumentRef.новаГруз</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
      <types>CatalogRef.новаСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
      <types>CatalogRef.новаСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаОтправления</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПрибытия</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОтправленияС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОтправленияПо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытияС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытияПо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПребыванияГрузоотправителя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПребыванияГрузополучателя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.новаВидыМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаПодтверждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаЗапланирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>VIP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхКатегорий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаВыполненаЧастично</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКатегорияТранспорта</name>
    <type>
      <types>CatalogRef.новаЗначенияКатегорийТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойКонтрагент</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
      <types>CatalogRef.новаСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяТочка</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Инкассация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Факт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаИнкассацииЗаПредыдущиеПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорииТранспортаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>90</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалДоставкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>41</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаИзмененаНаСамовывоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиДоМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиЗаМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБанковскойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКассовогоОбслуживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКАдресуДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БылЗаезд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресИзмененТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженныйАдресДоставки</name>
    <comment>1568 </comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КатегорииТранспорта</name>
    <attributes>
      <name>ЗначениеКатегории</name>
      <type>
        <types>CatalogRef.новаЗначенияКатегорийТранспорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоходыРасходы</name>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.новаСтатьиДоходовРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

EDT/УТ/src/Enums/новаВидыМестнойДоставки/новаВидыМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>новаВидыМестнойДоставки</name>
  <enumValues>
    <name>Разгрузка</name>
  </enumValues>
  <enumValues>
    <name>Погрузка</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПеремещение</name>
  </enumValues>
  <enumValues>
    <name>ВнешнееПеремещение</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/новаЭтапыМестнойДоставки/новаЭтапыМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаЭтапыМестнойДоставки</name>
  <predefined>
    <items>
      <name>ЗавершениеМестнойДоставки</name>
      <description>Завершение местной доставки</description>
    </items>
    <items>
      <name>ЗавершениеПланирования</name>
      <description>Завершение планирования</description>
    </items>
    <items>
      <name>ОбработкаНедовозаМестнойДоставки</name>
      <description>Обработка недовоза местной доставки</description>
    </items>
    <items>
      <name>ПланированиеМестнойДоставки</name>
      <description>Планирование местной доставки</description>
    </items>
    <items>
      <name>ПодготовкаКВыездуМестнойДоставки</name>
      <description>Подготовка к выезду местной доставки</description>
    </items>
    <items>
      <name>СогласованиеМестнойДоставки</name>
      <description>Согласование местной доставки</description>
    </items>
    <items>
      <name>СогласованиеПланированияМестнойДоставки</name>
      <description>Согласование планирования местной доставки</description>
    </items>
    <items>
      <name>СопровождениеМестнойДоставки</name>
      <description>Сопровождение местной доставки</description>
    </items>
  </predefined>
  <attributes>
    <name>ВыполнятьЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/новаТочкиДоставки/новаТочкиДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаТочкиДоставки</name>
  <attributes>
    <name>ВладелецТочки</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>CatalogRef.новаАдреса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПребывания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаПланирования</name>
    <type>
      <types>CatalogRef.новаСменыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособыДоставкиЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхКатегорий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПосещения</name>
    <type>
      <types>CatalogRef.новаРежимыПосещенияТочекДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Радиус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗонПогрузкиРазгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНахождениеТранспортаВРадиусе</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.новаПриоритетыТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресИзЯндекса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Москва</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикРаботы</name>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПребывания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КатегорииТранспорта</name>
    <attributes>
      <name>ЗначениеКатегории</name>
      <type>
        <types>CatalogRef.новаЗначенияКатегорийТранспорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъемВывоза</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.новаНоменклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <types>CatalogRef.новаЕдиницыНоменклатуры</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/BusinessProcesses/новаМестнаяДоставка/ObjectModule.bsl
Перем ИсходнаяПометкаУдаление;

Функция ПолучитьВариантыКартыМаршрута() Экспорт
	тзВарианты = Новый ТаблицаЗначений;
	тзВарианты.Колонки.Добавить("ИмяЭлемента");
	тзВарианты.Колонки.Добавить("Роль");
	тзВарианты.Колонки.Добавить("ЭлементыДа", Новый ОписаниеТипов("Массив"));
	тзВарианты.Колонки.Добавить("ЭлементыНет", Новый ОписаниеТипов("Массив"));
	
	стрВариант = тзВарианты.Добавить();
	стрВариант.ИмяЭлемента = "СогласованиеНеобходимо";
	стрВариант.Роль = Справочники.новаЭтапыМестнойДоставки.СогласованиеМестнойДоставки;
	стрВариант.ЭлементыДа.Добавить("Линия21");
	стрВариант.ЭлементыДа.Добавить("СогласованиеДоставки");
	стрВариант.ЭлементыДа.Добавить("Линия19");
	стрВариант.ЭлементыНет.Добавить("Линия20");
	
	Возврат тзВарианты;
КонецФункции

Процедура СогласованиеНеобходимоПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = новаМестнаяДоставка.НужноВыполнятьТочкуМаршрута(Справочники.новаЭтапыМестнойДоставки.СогласованиеМестнойДоставки);
	Если Не Результат Тогда
		ДоставкаПодтверждена = Истина;
		ДоставкаОтменена = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверкаРезультатаСогласованияОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	Если ДоставкаПодтверждена Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ДоставкаПодтверждена;		
		
	ИначеЕсли ДоставкаОтменена Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ОтказОтДоставки;		
	
	КонецЕсли;
КонецПроцедуры

Процедура ПроверкаРезультатаПланированияОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	Если ДоставкаЗапланирована Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ПланированиеУспешно;		
		
	ИначеЕсли ДоставкаОтменена Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ОтказОтДоставки;		
	
	КонецЕсли;
КонецПроцедуры

Процедура ЗавершениеДоставкиНеобходимоПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = новаМестнаяДоставка.НужноВыполнятьТочкуМаршрута(Справочники.новаЭтапыМестнойДоставки.ЗавершениеМестнойДоставки);
	Если Не Результат Тогда
		ДоставкаЗавершена = Истина;
		ДоставкаВыполнена 			= Истина;
		РезультатДоставки    		= Справочники.новаРезультатМестнойДоставки.Выполнена; 
	КонецЕсли;
КонецПроцедуры

Процедура ВыборВарианта4ОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
		Если ДоставкаВыполнена Тогда
			Результат = ТочкаВыбораВарианта.Варианты.ДоставкаЗавершена;			
		Иначе
			Если ДоставкаВыполненаЧастично Тогда
			    Результат = ТочкаВыбораВарианта.Варианты.ДоставкаВыполненаЧастично;
			Иначе
				Результат = ТочкаВыбораВарианта.Варианты.ДоставкаНеВыполнена;
			КонецЕсли;
			
		КонецЕсли;
КонецПроцедуры

Процедура СопровождениеДоставкиНеобходимоПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = новаМестнаяДоставка.НужноВыполнятьТочкуМаршрута(Справочники.новаЭтапыМестнойДоставки.СопровождениеМестнойДоставки);
	Если Не Результат Тогда
		ДоставкаВыполнена = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если не (ПометкаУдаления или ОбменДанными.Загрузка) Тогда
		
		Если Не ЗначениеЗаполнено(Грузоотправитель) Тогда
			Сообщить("Не заполнен грузоотправитель!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ТочкаОтправления) Тогда
			Сообщить("Не заполнена точка отправления!", СтатусСообщения.Важное);
			ТочкаОтправления = Справочники.новаТочкиДоставки.НайтиПоКоду("000394004");
			//Отказ = Истина;
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ВремяОтправленияС)ИЛИ ВремяОтправленияС = 0101001 Тогда
			Сообщить("Не заполнена дата отправления!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ВремяОтправленияС)
		     И ЗначениеЗаполнено(ВремяОтправленияПо) Тогда
		 
			Если НачалоДня(ВремяОтправленияС) > НачалоДня(ВремяОтправленияПо)
			 	ИЛИ (НачалоДня(ВремяОтправленияС) = НачалоДня(ВремяОтправленияПо) И ВремяОтправленияС > ВремяОтправленияПо) Тогда
					Сообщить("Крайняя дата отправления меньше начальной даты отправления!", СтатусСообщения.Важное);
					Отказ = Истина;
			КонецЕсли;
		
		КонецЕсли;
				
		Если Не ЗначениеЗаполнено(Грузополучатель) Тогда
			Сообщить("Не заполнен грузополучатель!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ТочкаПрибытия) Тогда
			Сообщить("Не заполнена точка прибытия!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ВремяПрибытияС) Тогда
			Сообщить("Не заполнена дата прибытия!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВремяПрибытияС)
		     И ЗначениеЗаполнено(ВремяПрибытияПо) Тогда
			 
				Если НачалоДня(ВремяПрибытияС) > НачалоДня(ВремяПрибытияПо)
			     	ИЛИ (НачалоДня(ВремяПрибытияС) = НачалоДня(ВремяПрибытияПо) И ВремяПрибытияС > ВремяПрибытияПо) Тогда
		     			Сообщить("Конечная дата/время прибытия меньше начальной даты прибытия!", СтатусСообщения.Важное);
		     			Отказ = Истина;
	    		КонецЕсли;		
			КонецЕсли;
			
	    Если ЗначениеЗаполнено(ВремяОтправленияС)
			 и ЗначениеЗаполнено(ВремяПрибытияПо) Тогда
			  		 			
			Если НачалоДня(ВремяОтправленияС) > НачалоДня(ВремяПрибытияПо)
				 ИЛИ (НачалоДня(ВремяОтправленияС) = НачалоДня(ВремяПрибытияПо) И ВремяОтправленияС > ВремяПрибытияПо) Тогда
				
				Сообщить("Конечная дата/время прибытия меньше начальной даты отправления!", СтатусСообщения.Важное);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Если ((Вид  = Перечисления.новаВидыМестнойДоставки.Погрузка) ИЛИ 
			 (Вид = Перечисления.новаВидыМестнойДоставки.ВнешнееПеремещение)) Тогда	 
				  ИнтервалДоставкиСтрокой=Формат(ВремяОтправленияС,"ДФ=ЧЧ:мм")+"-"+Формат(ВремяОтправленияПо,"ДФ=ЧЧ:мм");
		ИначеЕсли ((Вид  = Перечисления.новаВидыМестнойДоставки.Разгрузка) ИЛИ 
			      (Вид = Перечисления.новаВидыМестнойДоставки.ВнутреннееПеремещение)) Тогда
			          ИнтервалДоставкиСтрокой=Формат(ВремяПрибытияС,"ДФ=ЧЧ:мм")+"-"+Формат(ВремяПрибытияПо,"ДФ=ЧЧ:мм");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Вид) Тогда
		Если ТипЗнч(Грузоотправитель) = Тип("СправочникСсылка.новаКонтрагенты") Тогда
			Если ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.новаКонтрагенты") Тогда
				Вид = Перечисления.новаВидыМестнойДоставки.ВнешнееПеремещение;
			Иначе
				Вид = Перечисления.новаВидыМестнойДоставки.Погрузка;
			КонецЕсли;
		Иначе	
			Если ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.новаКонтрагенты") Тогда
				Вид = Перечисления.новаВидыМестнойДоставки.Разгрузка;
			Иначе
				Вид = Перечисления.новаВидыМестнойДоставки.ВнутреннееПеремещение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	соВыбранныеКатегории = Новый Соответствие;
	Для Каждого стрКатегория Из КатегорииТранспорта Цикл
		соВыбранныеКатегории.Вставить(стрКатегория.ЗначениеКатегории.Владелец, Истина);
	КонецЦикла;
	КоличествоВыбранныхКатегорий = соВыбранныеКатегории.Количество();
	
	ОсновнаяКатегорияТранспорта = Неопределено;
	Для Каждого стрКатегория Из КатегорииТранспорта Цикл
		Если стрКатегория.ЗначениеКатегории.Владелец.ОсновнаяКатегория Тогда
			ОсновнаяКатегорияТранспорта = стрКатегория.ЗначениеКатегории;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОсновнойКонтрагент = Грузоотправитель Тогда
		ОсновнаяТочка = ТочкаОтправления;
		
	ИначеЕсли ОсновнойКонтрагент = Грузополучатель Тогда
		ОсновнаяТочка = ТочкаПрибытия;
		
	Иначе
		Если ТипЗнч(Грузоотправитель) = Тип("СправочникСсылка.новаКонтрагенты") Тогда
			ОсновнойКонтрагент = Грузоотправитель;	
			ОсновнаяТочка = ТочкаОтправления;
			
		ИначеЕсли ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.новаКонтрагенты") Тогда
			ОсновнойКонтрагент = Грузополучатель;	
			ОсновнаяТочка = ТочкаПрибытия;
			
		Иначе
			ОсновнойКонтрагент = Грузополучатель;	
			ОсновнаяТочка = ТочкаПрибытия;
			
		КонецЕсли;
	КонецЕсли;
	
	КатегорииТранспортаСтрокой = новаТранспорт.СформироватьПолноеНаименованиеКатегории(КатегорииТранспорта);		
	
КонецПроцедуры

Процедура СогласованиеДоставкиПриСозданииВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса, ФормируемыеБизнесПроцессы, Отказ)
	Для Каждого Процесс Из ФормируемыеБизнесПроцессы Цикл
		Процесс.Доставка = Ссылка;
	КонецЦикла;
КонецПроцедуры

Процедура СогласованиеДоставкиПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ДоставкаПодтверждена = Задача.ДоставкаСогласована;
	ДоставкаОтменена = Задача.ДоставкаОтменена;
КонецПроцедуры

Процедура ПланированиеДоставкиПриСозданииВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса, ФормируемыеБизнесПроцессы, Отказ)
	Для Каждого Процесс Из ФормируемыеБизнесПроцессы Цикл
		Процесс.Доставка = Ссылка;
	КонецЦикла;
КонецПроцедуры

Процедура ПланированиеДоставкиПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ДоставкаЗапланирована = Задача.ДоставкаЗапланирована;
	ДоставкаОтменена = Задача.ДоставкаОтменена;
КонецПроцедуры

Процедура СопровождениеДоставкиПриСозданииВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса, ФормируемыеБизнесПроцессы, Отказ)
	Для Каждого Процесс Из ФормируемыеБизнесПроцессы Цикл
		Процесс.Доставка = Ссылка;
	КонецЦикла;
КонецПроцедуры

Процедура СопровождениеДоставкиПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ДоставкаВыполнена = Задача.ДоставкаВыполнена;
КонецПроцедуры

Процедура ЗавершениеДоставкиПриСозданииВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса, ФормируемыеБизнесПроцессы, Отказ)
	Для Каждого Процесс Из ФормируемыеБизнесПроцессы Цикл
		Процесс.Доставка = Ссылка;
	КонецЦикла;
КонецПроцедуры

Процедура ЗавершениеДоставкиПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ДоставкаВыполнена 			= Задача.ДоставкаВыполнена;
	ДоставкаЗавершена 			= Задача.ДоставкаЗавершена;
	ДоставкаВыполненаЧастично 	= Задача.ДоставкаВыполненаЧастично;
	РезультатДоставки    		= Задача.РезультатДоставки; 
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления <> ИсходнаяПометкаУдаление Тогда
		
		Если ЗначениеЗаполнено( Груз ) Тогда
			обГруз = Груз.ПолучитьОбъект();
			Если Груз.ПометкаУдаления <> ПометкаУдаления Тогда
				обГруз.УстановитьПометкуУдаления(ПометкаУдаления);
			КонецЕсли;
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	новаЗадачаМестнойДоставки.БизнесПроцесс.Ссылка КАК БизнесПроцесс,
		|	NULL КАК Задачи
		|ИЗ
		|	Задача.новаЗадачаМестнойДоставки КАК новаЗадачаМестнойДоставки
		|ГДЕ
		|	новаЗадачаМестнойДоставки.БизнесПроцесс.Доставка = &БизнесПроцесс
		| И новаЗадачаМестнойДоставки.БизнесПроцесс.ПометкаУдаления = &ИсходнаяПометкаУдаление
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	новаЗадачаМестнойДоставки.Ссылка
		|ИЗ
		|	Задача.новаЗадачаМестнойДоставки КАК новаЗадачаМестнойДоставки
		|ГДЕ
		|	новаЗадачаМестнойДоставки.БизнесПроцесс.Ссылка = &БизнесПроцесс
		| И новаЗадачаМестнойДоставки.ПометкаУдаления = &ИсходнаяПометкаУдаление
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	новаЗадачаМестнойДоставки.Ссылка
		|ИЗ
		|	Задача.новаЗадачаМестнойДоставки КАК новаЗадачаМестнойДоставки
		|ГДЕ
		|	новаЗадачаМестнойДоставки.БизнесПроцесс.Доставка = &БизнесПроцесс
		| И новаЗадачаМестнойДоставки.ПометкаУдаления = &ИсходнаяПометкаУдаление";
		Запрос.Параметры.Вставить("БизнесПроцесс", Ссылка);
		Запрос.Параметры.Вставить("ИсходнаяПометкаУдаление", ИсходнаяПометкаУдаление);
		тзЗадачи = Запрос.Выполнить().Выгрузить();
		
		Для Каждого стрЗадача Из тзЗадачи Цикл
			Если ЗначениеЗаполнено(стрЗадача.БизнесПроцесс) Тогда
				обВложенныйБизнесПроцесс = стрЗадача.БизнесПроцесс.ПолучитьОбъект();
				обВложенныйБизнесПроцесс.УстановитьПометкуУдаления(ПометкаУдаления);
			Иначе
				обЗадача = стрЗадача.Задачи.ПолучитьОбъект();
				обЗадача.УстановитьПометкуУдаления(ПометкаУдаления);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
//херим нова	
	//херим нова
	//Попытка
	//	новаОбменКСЛ.СохранитьДоставку(ЭтотОбъект);
	//Исключение
	//	#Если Клиент Тогда			
	//		новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
	//	#КонецЕсли
	//	Отказ = Истина;
	//КонецПопытки;
	//херим нова
//херим нова	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
//херим нова	
	//Попытка
	//	новаОбменКСЛ.УдалитьДоставку(ЭтотОбъект);
	//Исключение
	//	#Если Клиент Тогда			
	//		новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
	//	#КонецЕсли
	//	Отказ = Истина;
	//КонецПопытки;
//херим нова	
КонецПроцедуры

Процедура ПроверкаВозвратаНаПланированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	// Нужно ли возвращать доставку на планирование
	Результат = Ложь;
	Если Не ДоставкаВыполнена И Не ДоставкаВыполненаЧастично Тогда
		Если Час(ТекущаяДата()) < 7 Тогда
			Если НачалоДня(Дата) = НачалоДня(ТекущаяДата()) Тогда
				Результат = Истина; // Возвращаем только те доставки, дата которых была перенесена на поздние даты
			КонецЕсли;
		Иначе	
			Если НачалоДня(Дата) > ТекущаяДата() Тогда
				Результат = Истина; // Возвращаем только те доставки, дата которых была перенесена на поздние даты
			КонецЕсли;
		КонецЕСли;
	КонецЕсли;
	
	
	
	Если Результат Тогда
		Зап = Новый Запрос;
		// если существуют доставки, нераскинутые по рейсам, возвращаем рейсы на планирование.
		Зап.Текст = "ВЫБРАТЬ
		            |	новаЗадачаРейсаМестнойДоставки.Ссылка
		            |ИЗ
		            |	Задача.новаЗадачаРейсаМестнойДоставки КАК новаЗадачаРейсаМестнойДоставки
		            |ГДЕ
		            |	новаЗадачаРейсаМестнойДоставки.Роль = &Планирование
		            |	И новаЗадачаРейсаМестнойДоставки.Выполнена = ЛОЖЬ
		            |	И новаЗадачаРейсаМестнойДоставки.БизнесПроцесс.ДатаНачала >= &ДатаРейса";
		Зап.УстановитьПараметр("ДатаРейса", НачалоДня(Дата));			
		Зап.УстановитьПараметр("Планирование", Справочники.новаЭтапыМестнойДоставки.ПланированиеМестнойДоставки);			
		Рез = Зап.Выполнить();
		
		
		Если Рез.Пустой() Тогда
			ЗР = Новый Запрос;
			ЗР.Текст = "ВЫБРАТЬ
			           |	новаЗадачаРейсаМестнойДоставки.БизнесПроцесс.Ссылка КАК БП
			           |ИЗ
			           |	Задача.новаЗадачаРейсаМестнойДоставки КАК новаЗадачаРейсаМестнойДоставки
			           |ГДЕ
			           |	новаЗадачаРейсаМестнойДоставки.Выполнена = ИСТИНА
			           |	И новаЗадачаРейсаМестнойДоставки.Роль = &Планирование
			           |	И новаЗадачаРейсаМестнойДоставки.БизнесПроцесс.ДатаНачала >= &ВыбДата";
			
			ЗР.УстановитьПараметр("Планирование", Справочники.новаЭтапыМестнойДоставки.ПланированиеМестнойДоставки);			
			ЗР.УстановитьПараметр("ВыбДата", НачалоДня(Дата));
			
			Выб = ЗР.Выполнить().Выбрать();
			Пока Выб.Следующий() Цикл
				Об = Выб.БП.ПолучитьОбъект();
				Об.РейсНадоПерепланировать = Истина;
				Об.Записать();
			КонецЦикла;	
		КонецеСли;	
	КонецеСли;
КонецПроцедуры
			   
ИсходнаяПометкаУдаление = Ссылка.ПометкаУдаления;
